src/cf/Catalogs/StageOfLimitsForEmployees.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>StageOfLimitsForEmployees</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>TypeOfLimit</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.TypesOfLimitsForEmployees</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EmploymentContract</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.EmploymentContract</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DescriptionKey</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>StartDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EndDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/InformationRegisters/EmployeeLimitPlaning.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>EmployeeLimitPlaning</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Limit</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>NotApplicable</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>LimitDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>LimitDateEnd</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>StageDescription</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Entity</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._DemoCompanies</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Employee</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._DemoIndividuals</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>TypeOfLimit</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.TypesOfLimitsForEmployees</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Stage</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.StageOfLimitsForEmployees</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Catalogs/StageOfLimitsForEmployees/Ext/ManagerModule.bsl
Function FindByDescriptionKey(Description, EmploymentContract, TypeOfLimit) Export 

	Query = New Query;
	Query.Text =
	"SELECT
	|	StageOfLimitsForEmployees.Ref AS Ref
	|FROM
	|	Catalog.StageOfLimitsForEmployees AS StageOfLimitsForEmployees
	|WHERE
	|	StageOfLimitsForEmployees.EmploymentContract = &EmploymentContract
	|	AND StageOfLimitsForEmployees.TypeOfLimit = &TypeOfLimit
	|	AND StageOfLimitsForEmployees.DescriptionKey = &DescriptionKey";

	Query.SetParameter("EmploymentContract", EmploymentContract);
	Query.SetParameter("TypeOfLimit", TypeOfLimit);
	Query.SetParameter("DescriptionKey", GetDescriptionKey(Description));

	Selection = Query.Execute().Select();
	If Selection.Next() Then
		Return Selection.Ref;
	Else
		Return Undefined;
	EndIf;

EndFunction

Function UpdateStage(Description, EmploymentContract, TypeOfLimit, StartData, EndData, Ref = Undefined, CreateNotFound = True) Export 

	If Ref <> Undefined Then
		Object = Ref.GetObject();
	Else
		Object = Undefined;
	EndIf;

	If Object = Undefined Then
		If CreateNotFound Then

			Object = Catalogs.StageOfLimitsForEmployees.CreateItem();
			
			If Ref <> Undefined Then
				Object.SetNewObjectRef(Ref);
			EndIf;
		Else
			Return Undefined;
		EndIf;
	EndIf;

	Object.Description 	= Description;
	Object.StartDate	= StartData;
	Object.EndDate		= EndData;

	Object.EmploymentContract 	= EmploymentContract;
	Object.TypeOfLimit 			= TypeOfLimit;
	Object.DescriptionKey 		= GetDescriptionKey(Object.Description);

	Object.Write();

	Return Object.Ref;

EndFunction

Procedure UpdateStageForRef(Ref, Description, StartData, EndData) Export 

	Object = Ref.GetObject();

	Query = New Query;
	Query.Text = 
	"SELECT DISTINCT
	|	EmployeeLimitPlaningSliceLast.LimitDate AS StartData,
	|	EmployeeLimitPlaningSliceLast.LimitDateEnd AS EndData,
	|	EmployeeLimitPlaningSliceLast.StageDescription AS Description
	|FROM
	|	InformationRegister.EmployeeLimitPlaning.SliceLast(, Stage = &Ref) AS EmployeeLimitPlaningSliceLast";

	Query.SetParameter("Ref", Ref);

	Selection = Query.Execute().Select();

	// если по этапу уже есть движения в графике, то необходимо актуализировать
	// его в соответствии с последними изменениями графика
	If Selection.Next() Then
		FillPropertyValues(Object, Selection);
	Else
		Object.Description 	= Description;
		Object.StartDate	= StartData;
		Object.EndDate		= EndData;
	EndIf;

	Object.DescriptionKey 	= GetDescriptionKey(Object.Description);
	Object.Write();

EndProcedure

Function GetDescriptionKey(Description) Export 

	DescriptionKey = StrReplace(Description, " ", "");	
	DescriptionKey = Upper(DescriptionKey);

	Return DescriptionKey;

EndFunction
